using StackAndQueue.Questions;
using System.Collections.Generic;

namespace StackAndQueue
{
    class Program
    {
        static void Main(string[] args)
        {
            new Question1().Init("Exemple(text([<]>))");
            new Question2().Init(new List<int> { -15, -4023, 43, 423, 334, -30, 547, 183, 846,-623, 0 });
            new Question3().Init("18*(37-46/2)+17*2");
            new Question4().Init();
            new Question5().Init();
        }
    }
}

/*

+
Задача 1. Дано рядок символів, що містить дужки різних видів (круглі, фігурні, квадратні). Перевірте правильність розставлення в  ньому круглих дужок, будь-яких дужок.

+
Задача 2. Дана послідовність ненульових цілих чисел. Ознакою кінця послідовності є число 0. Знайдіть серед них перший найбільший (найменший)  по модулю від’ємний елемент. Якщо такого елемента немає, то виведіть повідомлення про це.

+
Задача 3. Реалізуйте алгоритми обчислення арифметичних виразів – перетворення в постфіксну форму, обчислення постфіксного виразу.

+
Задача 4. Напишіть програму, що моделює чергу покупців в каси в магазині. Програма повинна відображати вміст відразу декількох черг. Новий покупець переміщується в чергу натисканням клавіші. Ви повинні самостійно визначити, яким чином він буде вибирати чергу. Обслуговування кожного покупця має випадкову тривалість (в залежності від кількості товарів в кошику). Обслужені покупці видаляються з черги. 

//todo
Задача 5. Реалізуйте основні операції із списками, стеками та чергами (за матеріалами лекцій).
{
~~~стек:  
створення стека
друк(перегляд) стека
додавання елементів у вернишу стека
витяг елементів з вершини стека
перевірка порожнини стека
очищення стека
~~~черга:
створення черги
друг(перегляд черги)
додавання елемента в кінець черги
витяг елемента з початку черки
перевірка порожнечі черги
очищення черги
}
 */
